uhnp/src/InformationRegisters/СвязьКонтрагентовИБанков/СвязьКонтрагентовИБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьКонтрагентовИБанков</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>DefinedType.Банк</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СвязьКонтрагентовИБанков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПолучитьКонтрагентаПоБанку(Знач БанкСсылка) Экспорт

	Если ТипЗнч(БанкСсылка) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
		БанкСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанкСсылка,"Банк");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвязьКонтрагентовИБанков.Контрагент
	|ИЗ
	|	РегистрСведений.СвязьКонтрагентовИБанков КАК СвязьКонтрагентовИБанков
	|ГДЕ
	|	СвязьКонтрагентовИБанков.Банк = &Банк";
	Запрос.УстановитьПараметр("Банк", БанкСсылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() Тогда
		Возврат Результат[0].Контрагент;
	Иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБанкиПоКонтрагенту(КонтрагентСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьКонтрагентовИБанков.Банк
	|ИЗ
	|	РегистрСведений.СвязьКонтрагентовИБанков КАК СвязьКонтрагентовИБанков
	|ГДЕ
	|	СвязьКонтрагентовИБанков.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Банк");
	
КонецФункции	

Процедура ЗаписатьСвязь(Банк, Контрагент) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязьКонтрагентовИБанков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Банк.Установить(Банк);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Банк = Банк;
	НоваяЗапись.Контрагент = Контрагент;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
